{"id":"79414164","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"DevOps инженер в команду процессов и инструментов","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":{"city":"Москва","street":"улица Авиаконструктора Микояна","building":"12","lat":55.792589,"lng":37.527588,"description":null,"raw":"Москва, улица Авиаконструктора Микояна, 12","metro":{"station_name":"Аэропорт","line_name":"Замоскворецкая","station_id":"2.12","line_id":"2","lat":55.800441,"lng":37.530477},"metro_stations":[{"station_name":"Аэропорт","line_name":"Замоскворецкая","station_id":"2.12","line_id":"2","lat":55.800441,"lng":37.530477}]},"allow_messages":true,"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p>Привет! Я Кирилл, тимлид команды процессов и инструментов в Профи. Клиенты моей команды — сотрудники Профи. Мы отвечаем за стенды и другие инструменты проверки продукта, а ещё за Jira, Slack, Google и другие сервисы, которыми пользуется вся компания.</p> <p>Нам нужен DevOps, который сфокусируется на опыте разработчиков — продолжит наводить порядок в стендовых окружениях, заберёт часть задач у сисадминов и вместе с нами сделает эти процессы удобнее и эффективнее.</p> <p><strong>Технологии</strong></p> <p>Ansible, K8s, Jenkins, Nginx, MySQL, Bash, Git.</p> <p><strong>Зачем тебе к нам</strong></p> <ul> <li> <p>Определять будущее архитектуры стендов. Будешь главным девопсом в нашей команде. </p> </li> <li> <p>Пробовать новое. Точно сможешь выходить за рамки стандартных админских задач и попробовать себя в новых направлениях. Вокруг тебя будет много сильных ребят, которые всегда готовы помочь и поделиться опытом. </p> </li> <li> <p>Видеть результат своей работы. Мы улучшаем процессы и инструменты для своих коллег. Сможешь быстро получить фидбэк и увидеть реакцию на новые решения. </p> </li> <li>Наслаждаться корпоративной культурой. Ты обязательно найдёшь здесь новых друзей. Мы любим смеяться, тусоваться и отдыхать вместе. Например, летом всей компанией организовали четырёхдневный фестиваль в стиле Burning Man :)</li> </ul> <p><strong>Чем предстоит заниматься </strong></p> <p><em>В первое время:</em></p> <ul> <li>Навести порядок в стендовых базах и процессах их создания.</li> <li>Починить роутинг на стендах — приблизить его к продовому.</li> <li>Следить за стендами, разруливать проблемы.</li> </ul> <p><em>Когда освоишься:</em></p> <ul> <li>Добавить поддержку новых процессов тестирования. Например, чтобы когда разработчик создаёт новый сервис, он мог посмотреть, как это повлияет на мобильное приложение.</li> <li>Сделать атомарные джобы для сборки тестовых окружений.</li> <li>Перенять ответственность за CI.</li> </ul> <p><strong>Что нужно, чтобы к нам присоединиться</strong></p> <ul> <li>Умение поднять на виртуалке кластер Kubernetes и обслуживать его с помощью Ansible и Jenkins — хранить плейбуки и джобы в git, делать ревью изменений. А если какой-то Pod не запускается, можешь понять проблему почти без гугла :)</li> <li>Умение конфигурировать, решать проблемы с Nginx, HAProxy, PHP-FPM.</li> <li>Знание, как настроить мониторинг всего, что в твоей зоне ответственности. Например, отследить, когда у кластера Kubernetes заканчиваются ресурсы или когда Jenkins джоба фейлится.</li> <li>Интерес к настройке процессов. Сможешь разобраться в создании табличек на стендах и на проде, найти недостатки и предложить улучшения.</li> <li>Готовность иногда выходить за рамки стандартных админских задач, например:</li> <li>Оптимизировать SQL-запрос, если из-за переливки данных с прода на стенды будет что-то тормозить.</li> <li>Залезть в код на TypeScript и что-то там поменять, чтобы решить админскую проблему.</li> <li>Помочь разработчику посмотреть логи сервиса или разобраться в ошибке.</li> </ul> <p><strong>Что мы за это предлагаем</strong></p> <ul> <li> <p>Высокую зарплату, которую пересматриваем два раза в год.</p> </li> <li> <p>Опционы компании тем, кто круто себя проявит. Будешь брать большие проекты, развиваться и вдохновлять команду — они твои.</p> </li> <li> <p>100% ДМС с первого дня работы. Выбрали лучшие клиники в РФ и СНГ. А в других странах компенсируем походы к врачу или мед. страховку, которую ты выберешь.</p> </li> <li> <p>Тимбилдинги. Встречайся с профийцами в любом городе мира. Можно вместе сходить на квест, покататься на байдарках или покорить гору. Компания компенсирует веселье :-)</p> </li> <li> <p>Завтраки в офисе на Ходынском поле (10 минут от метро «ЦСКА» и 5 минут транспортом от метро «Аэропорт»): запеканки, каши, лосось и авокадо, омлеты, круассаны и другая вкуснятина.</p> </li> <li> <p>Оплату профильных курсов, участия в конференциях. Ещё помогаем написать статью или подготовить выступление, если тебе интересно делиться опытом.</p> </li> <li> <p>Пятничные посиделки в лофте. После работы мы любим собираться в нашем лофте недалеко от офиса, чтобы поболтать или поиграть в настолки.</p> </li> <li> <p>Корпоративные выезды, хакатоны, митапы, тренинги. Поверь, они всегда проходят очень круто.</p> </li> <li> <p>«Плюшку» на выбор с оплатой 50/50:</p> <ul> <li>Психотерапия. Поможем найти своего психотерапевта и оплатить часть стоимости сеансов.</li> <li>Спорт — компенсируем любую активность, где ты заключишь договор: фитнес-клуб, занятия с тренером, студии. В том числе за границей.</li> <li>Аренда коворкинга в любом городе мира, кроме Москвы (там уже есть отличный офис).</li> <li>Обустройство домашнего рабочего места — поможем оплатить нужную мебель и аксессуары для работы.</li> </ul> </li> <li> <p>Работу из любой точки мира. Приступай к задачам где и когда тебе удобно — в уютном офисе в Москве, на даче или за границей.</p> </li> <li> <p>Электронную библиотеку на любой вкус. Бесплатный доступ к издательству Альпина или 50% оплата подписки на другие библиотеки.</p> </li> <li> <p>Скидки на услуги специалистов Профи. Компенсируем до 50% стоимости заказа.</p> </li> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"MySQL"},{"name":"Git"},{"name":"Kubernetes"},{"name":"SQL"},{"name":"Jenkins"},{"name":"Atlassian Jira"},{"name":"Базы данных"},{"name":"Jira"},{"name":"Slack"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[],"professional_roles":[{"id":"160","name":"DevOps-инженер"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"83639","name":"Профи (profi.ru)","url":"https://api.hh.ru/employers/83639?host=hh.ru","alternate_url":"https://hh.ru/employer/83639","logo_urls":{"90":"https://hhcdn.ru/employer-logo/3788287.png","240":"https://hhcdn.ru/employer-logo/3788288.png","original":"https://hhcdn.ru/employer-logo-original/836851.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=83639&host=hh.ru","accredited_it_employer":true,"trusted":true},"published_at":"2023-09-04T16:05:11+0300","created_at":"2023-09-04T16:05:11+0300","initial_created_at":"2023-04-17T16:34:09+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=79414164","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/79414164","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false,"languages":[]}