{"id":"83560716","premium":false,"billing_type":{"id":"standard_plus","name":"Стандарт плюс"},"relations":[],"name":"DevOps TeamLead","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":{"city":"Москва","street":"Новодмитровская улица","building":"2Б","lat":55.805756,"lng":37.588979,"description":null,"raw":"Москва, Новодмитровская улица, 2Б","metro":null,"metro_stations":[]},"allow_messages":true,"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<strong>Чем предстоит заниматься:</strong> <p><strong>Основная задача заключается в создании и поддержании эффективных процессов разработки, развертывания и поддержки решений компании (NGFW, DC-Switch, NPB, NMS), а также в обеспечении сотрудничества и взаимодействия с другими командами проекта для достижения общих целей.</strong></p> <ul> <li><strong>Руководство командой:</strong> отвечать за организацию работы команды DevOps и координацию ее усилий для достижения целей проекта: планирование задач, распределение ресурсов, управление приоритетами и обеспечение эффективной коммуникации внутри команды.</li> <li><strong>Архитектура и проектирование</strong>: участие в проектировании архитектуры проектов (DC-switch, NGFW). Сотрудничество с другими членами команды разработки, анализ технические решения, улучшение процессов.</li> <li><strong>Разработка и автоматизация:</strong> руководство разработкой и поддержкой инструментов и процессов автоматизации для развертывания и управления продуктами компании - создание сценариев развертывания, конфигурация систем мониторинга и логирования, а также разработки скриптов и инструментов для автоматизации процессов разработки и тестирования.</li> <li><strong>Координация с другими командами: </strong>взаимодействие с другими командами проекта - Devs, QA, support для согласования требований, обмена информацией и управления зависимостями. Участие в согласовании и планировании релизов.</li> <li><strong>Мониторинг и поддержка: </strong>обеспечение непрерывной работы тестовой зоны - мониторинг системы, выявление и устранение проблем, реагирование на инциденты, а также поддержку пользователей и других команд проекта в вопросах, связанных с инфраструктурой и процессами развертывания.</li> <li><strong>Обучение и развитие команды:</strong> помощь в развитии навыков и компетенций членов команды DevOps. Оказание поддержки, проведение обучающих мероприятий, делегирование ответственности и стимулирование роста профессиональных навыков команды.</li> <li><strong>Соблюдение стандартов безопасности: </strong>обеспечение соблюдения требований безопасности в процессе разработки, развертывания и поддержки решений. Работа с командой по безопасности, проведение аудита инфраструктуры и внедрение рекомендации для обеспечения высокого уровня защиты и конфиденциальности данных.</li> </ul> <strong>Мы ожидаем:</strong> <ul> <li><strong>Опыт работы с VMware vSphere:</strong> понимание и опыт работы с виртуализацией, включая управление и настройку виртуальных машин, хостов, кластеров и других компонентов vSphere.</li> <li><strong>GitLab CI/CD:</strong> опыт работы с инструментами непрерывной интеграции и непрерывной доставки, в том числе с GitLab CI/CD. Это включает создание и настройку конвейеров (pipelines), автоматизацию сборки, тестирования и развертывания приложений.</li> <li><strong>Terraform:</strong> опыт внедрения практик IaC (Infrastructure as Code) с использованием Terraform.</li> <li><strong>Ansible:</strong> навыки автоматизации и оркестрации с использованием Ansible.</li> <li><strong>Хорошее понимание концепций и практик DevOps:</strong> должен быть хорошо знаком с принципами DevOps и практиками, такими как непрерывная интеграция, непрерывная доставка, автоматизация и контейнеризация.</li> <li><strong>Контейнеризация:</strong> опыт работы с контейнерными технологиями, такими как Docker, и понимать концепции контейнеризации и оркестрации, такие как Kubernetes.</li> <li><strong>Опыт с системами мониторинга и журналирования: </strong>Prometheus, Grafana, ELK (Elasticsearch, Logstash, Kibana) и иметь опыт настройки и использования этих инструментов для обеспечения надежности и производительности системы.</li> <li><strong>ОС: Linux/Unix</strong> на серьёзном уровне администрирования, включая сборку ядра и компонентов, знание языков скриптования, таких как Bash, Python</li> <li><strong>Сетевые технологии:</strong> глубокое знание стека TCP/IP, протоколы динамической маршрутизации, настройка Д3 коммутаторов с использованием Ansible.</li> </ul> <strong>С нами можно:</strong>​​​​​​​ <ul> <li>Постоянно придумывать и реализовывать свои инструменты и подходы. Скучно в работе точно не будет.</li> <li>Неограниченно совершенствовать свои навыки и знания и решать сверхамбициозные и интересные задачи</li> <li>Держать баланс между свободой действий и ответственностью</li> <li>Получать конкурентный уровень заработной платы (готовы по достоинству оценить ваши знания и опыт) + премирование по результатам работы + надбавка за выслугу лет</li> <li>Работать в комфортном офисе в БЦ «Дмитровский» с собственной кухней, лаунж-зоной с настольным теннисом и массажным креслом и совмещать с удаленной работой</li> <li>Заботиться о здоровье. Оформим полис ДМС со стоматологией после испытательного срока</li> <li>Развиваться и отдыхать. Доступ к библиотеке, корпоративные мероприятия, конференции, выставки и обучение</li> <li>Работать над масштабными проектами, написанными «с нуля» в команде профессионалов</li> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[],"professional_roles":[{"id":"114","name":"Системный инженер"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"3452582","name":"ТехАргос","url":"https://api.hh.ru/employers/3452582?host=hh.ru","alternate_url":"https://hh.ru/employer/3452582","logo_urls":{"90":"https://hhcdn.ru/employer-logo/2586429.jpeg","240":"https://hhcdn.ru/employer-logo/2586430.jpeg","original":"https://hhcdn.ru/employer-logo-original/536239.jpg"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=3452582&host=hh.ru","accredited_it_employer":false,"trusted":true},"published_at":"2023-09-03T15:21:10+0300","created_at":"2023-09-03T15:21:10+0300","initial_created_at":"2023-07-17T15:21:09+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=83560716","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/83560716","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false,"languages":[]}