{"id":"84541193","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"DevOps Tech Lead","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"experience":{"id":"moreThan6","name":"Более 6 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p>Playrix в топ-3 самых прибыльных мобильных разработчиков мира. Мы создали такие хиты, как Gardenscapes, Fishdom, Manor Matters, Homescapes, Wildscapes и Township. Их скачали более двух миллиардов игроков, а ежемесячная аудитория наших игр — 120 миллионов человек.</p> <p>Мы в поиске<strong> DevOps Tech Lead </strong>в команду серверной инфраструктуры. Она отвечает за работоспособность, надежность и эффективность всей игровой серверной инфраструктуры. Ей пользуются не только игроки по всему свету, но и внутренние команды.</p> <p>Перед вами будут стоять задачи по разработке архитектурных решений, автоматизации процессов, повышению эффективности использования ресурсов и безопасности. <strong>Не подразумевается руководство инженерами, фокус на разработку сложных решений и техническое лидерство процессов.</strong></p> <p><strong>Команда:</strong> Team Lead, Solution Architect, 8 DevOps инженеров</p> <p><strong>Стек:</strong> AWS, Terraform, Nomad, Consul, Vault, Openresty, PostgreSQL, MongoDB, Grafana, ELK, Zabbix, Python для автоматизации.</p> <p><strong>Эта вакансия предполагает обязательную релокацию из России и Беларуси с возможностью работы удаленно из любой точки мира или в одном из наших офисов в Сербии, Армении, Казахстане, Кипре.</strong></p> <p><strong>Задачи</strong></p> <ul> <li> <p>разработка архитектурных решений</p> </li> <li> <p>исследование и внедрение новых технологий для постоянного совершенствования облачной инфраструктуры</p> </li> <li> <p>разработка и внедрение автоматизации, в первую очередь для масштабирования систем под пиковую и плановую нагрузку: троттлинг, автоскейлинг, балансировка нагрузки</p> </li> <li> <p>улучшение и развитие системы сбора технических метрик для лучшей оценки производительности и состояния серверной инфраструктуры игровых проектов и клиентских приложений</p> </li> <li> <p>управление инцидентами</p> </li> <li> <p>развитие сервисов, участие в принятии архитектурных решений</p> </li> </ul> <p><strong>Мы ожидаем</strong></p> <ul> <li> <p>релевантный опыт работы на высоконагруженных проектах от 5 лет</p> </li> <li> <p>уверенное владение python или golang, навыки написания сложной автоматизации</p> </li> <li> <p>опыт работы с <strong>AWS</strong>: сервисы EC2, S3, DynamoDB, Kinesis, RDS, Route53, Load Balancers, API gateways, Lambda</p> </li> <li> <p>опыт работы с Docker и системами оркестрации Hashicorp Nomad или Kubernetes</p> </li> <li> <p>опыт работы с Linux, уверенное владение консолью, bash scripting</p> </li> <li> <p>опыт работы с системами мониторинга (Grafana, Statsite, Carbon, Victoria Metrics, ELK)</p> </li> <li> <p>будет плюсом опыт промышленной разработки backend</p> </li> </ul> <p><strong>Мы предлагаем</strong></p> <ul> <li><strong>Комфортные условия</strong>. Работайте удаленно из любой точки мира. Мы гибко подходим к вопросам релокации и помогаем с переездом</li> <li><strong>Забота о здоровье</strong>. Компенсируем онлайн-сессии с психологом, открываем для вас и ваших детей ДМС со стоматологией и лечением от COVID-19.Забота о благополучии. Сохраняем 100% зарплату во время отпуска или больничного без лишних справок. А для особых случаев предоставим дополнительные выходные</li> <li><strong>Удобное рабочее место</strong>. У нас есть все для комфортной работы, где бы вы не находились. В офисах – зоны отдыха и горячее питание, для удаленных сотрудников — доставка современной техники</li> <li><strong>Спорт и фитнес</strong>. Поддерживаем здоровый образ жизни и компенсируем покупку любых спортивных абонементов, подписку на фитнес-приложение или участие в марафонах</li> <li><strong>Социальные проекты</strong>. Запускаем благотворительные проекты и поддерживаем идеи сотрудников в конкурсе грантов</li> <li><strong>Релокационный пакет</strong>. Мы помогаем с переездом сотрудникам, их семьям и домашним животным, а также организуем услуги консьерж-сервиса и риелторского агентства</li> </ul>","branded_description":null,"vacancy_constructor_template":{"id":32893,"name":"Брендированный шаблон 1","top_picture":{"height":684,"width":1880,"path":"https://hhcdn.ru/branding-pictures/1755315.jpeg","blurred_path":"https://hhcdn.ru/branding-pictures-blurred/1755317.jpeg"},"bottom_picture":null},"key_skills":[{"name":"AWS"},{"name":"Golang"},{"name":"Python"},{"name":"Highload"},{"name":"Автоматизация"},{"name":"Hashicorp"},{"name":"Nomad"},{"name":"Kubernetes"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[],"professional_roles":[{"id":"160","name":"DevOps-инженер"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"9056925","name":"Playrix","url":"https://api.hh.ru/employers/9056925?host=hh.ru","alternate_url":"https://hh.ru/employer/9056925","logo_urls":{"240":"https://hhcdn.ru/employer-logo/6053838.png","90":"https://hhcdn.ru/employer-logo/6053837.png","original":"https://hhcdn.ru/employer-logo-original/1108309.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=9056925&host=hh.ru","accredited_it_employer":false,"trusted":true},"published_at":"2023-08-28T12:49:11+0300","created_at":"2023-08-28T12:49:11+0300","initial_created_at":"2023-08-04T10:59:51+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=84541193","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/84541193","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false,"languages":[]}