{"id":"84960387","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Senior DevOps Engineer в команду DevCore сервиса путешествий","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":{"city":"Москва","street":"1-й Нагатинский проезд","building":"10","lat":55.678458,"lng":37.632287,"description":null,"raw":"Москва, 1-й Нагатинский проезд, 10","metro":{"station_name":"Нагатинская","line_name":"Серпуховско-Тимирязевская","station_id":"9.85","line_id":"9","lat":55.682099,"lng":37.620917},"metro_stations":[{"station_name":"Нагатинская","line_name":"Серпуховско-Тимирязевская","station_id":"9.85","line_id":"9","lat":55.682099,"lng":37.620917}]},"allow_messages":true,"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p>Мы в Туту занимаемся путешествиями, у нас есть электрички, самолёты, поезда, автобусы, отели, туры и вообще всё, что нужно для того, чтобы куда-то уехать и вернуться. Кроме продуктовых команд есть ещё инфраструктурные, и вот DevCore — это мы, те, кто помогают продуктовым разработчикам фокусироваться на их задачах. Для этого мы делаем инструменты, автоматизирующие рутинную работу. Например, у нас есть инструменты для быстрого развёртывания кода и публикации пакетов, сервисы по сбору и мониторингу ошибок, общие шаблоны сервисов, общие пакеты, инструменты кодогенерации клиентов.</p> <p>Сейчас мы хотим создать единую систему управления тестированием, и вы можете стать тем самым человеком, который поможет внедрить набор инструментов для тестирования, упростив работу разработчикам и тестировщикам.</p> <p><strong>Немного про стек:</strong></p> <p>В качестве инфраструктуры используем OpenShift OKD 4 на baremetal. Стек мониторинга и трейсинга у нас - ELK, Grafana, Prometheus и OpenTracing. Система исполнения пайплайнов Tekton, управление кодом в bitbucket git. Для таск трекинга пользуемся Jira, а документацию ведем в Readme.md и Confluence. Основной язык бекэнда у нас Go.</p> <p><strong>Основные задачи:</strong></p> <p>— Миграция и сопровождение Selenium Grid в кластер OpenShift, настройка динамического скейлинга кластера под нагрузкой;</p> <p>— Внедрение в продуктовые команды и интеграция системы управления тестированием Allure TestOps в наше окружение — Jira, Confluence, Selenium Grid и Tekton CI/CD;</p> <p>— Поддержка и развитие семейства инструментов Quality Wall, таких как — Linters, Sec scan, SonarQube;</p> <p>— Поддержка и развитие системы сбора процессных метрик из Jira, Bitbucket и Confluence.</p> <p><strong>От вас нужно:</strong></p> <p>— Опыт работы с OpenShift / Kubernetes как продвинутый пользователь;</p> <p>— Опыт и навыки администрирования Linux-систем;</p> <p>— Опыт эксплуатации отказоустойчивых и высоконагруженных систем;</p> <p>— Опыт работы с системами автоматизации Terraform, Ansible;</p> <p>— Опыт работы со стеком для observability — Prometheus, ELK, Grafana;</p> <p>— Опыт настройки пайплайнов в одной из систем — Jenkins / Gitlab CI / Github Actions / Redhat Tekton;</p> <p>— Навыки проведения сбора требований и анализа вариантов решений;</p> <p>— Навыки проектирования и планирования;</p> <p>— Коммуникабельность и клиентоориентированность, навыки общения с внутренними клиентами;</p> <p>— Опыт автоматизации своей работы при помощи одного из языков программирования.</p> <p><strong>Плюсом будет: </strong></p> <p>— Опыт разработки консольных утилит;</p> <p>— Желание создавать инструменты для разработчиков;</p> <p>— Опыт работы со спецификациями OpenAPI.JSON;</p> <p>— Опыт работы с Protobuffers;</p> <p>— Навыки разработки на Go / Python / JavaScript / Kotlin / PHP.</p> <p><strong>Про команду и рабочие процессы:</strong></p> <p>Текущие ключевые направления работ в DevCore команде:</p> <p>1) Поддержка и развитие общих шаблонов, общих модулей и общих библиотек. Текущие проекты — витрина общих компонентов фронтенда, обновление React 18 в компонентах фронтенда.</p> <p>2) Сервисы для разработчиков и консольные утилиты. Сервис Shared Static — это сервис для сохранения файлов и доступности на чтение через CDN. Набор сервисов для процесса Quality Wall — проверки линтер, сервисы для автоматизации тестирования. Текущие проекты — обновление и настройка скейлинга под нагрузкой Selenium Grid, Allure TestOps система управления тестированием, SonarQube анализатор кода, Pact — система контрактного тестирования.</p> <p>3) Инструменты для межсервисного взаимодействия. Текущие проекты — инструмент дискавери API, изучения ендпоинтов и генерации контрактов для работы с API, разработка инструмента кодогенерации клиентов на основе контрактов.</p> <p><strong>График работы:</strong></p> <p>Работать можно из офиса в Москве, гибридно или удаленно.</p> <p><strong>Про компанию:</strong></p> <p>— Компания с хорошим техническим стеком, техруководителями и готовностью одними из первых пробовать новые технологии;</p> <p>— Хорошая техническая инфраструктура, очень крутая внутренняя база знаний, культура API и так далее;</p> <p>— Открываются новые направления, где можно делать всё с нуля.</p> <p>Весь положенный набор плюшек: ДМС со стоматологией, кухня в офисе, страховка на путешествия, ноутбук, премии по результатам работы, оплата больничных, регулярная переиндексация зарплаты, а также обучение, премия за прочитанные книги и обмен опытом.</p> <p><strong>Структура собеседований:</strong></p> <p>— 30-минутное интервью-знакомство с руководителем и HR-менеджером;</p> <p>— Интервью с тех-специалистом из команды. Можно понять, достаточно ли профессиональна наша команда и комфортно ли вам с ней будет. Мы, в свою очередь, проверим ваши профессиональные знания и навыки);</p> <p>— Разговор с руководителем отдела и заместителем CTO.</p>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Linux"},{"name":"Kubernetes"},{"name":"Ansible"},{"name":"Prometheus"},{"name":"Grafana"},{"name":"ELK"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[],"professional_roles":[{"id":"160","name":"DevOps-инженер"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"5325","name":"Туту.ру","url":"https://api.hh.ru/employers/5325?host=hh.ru","alternate_url":"https://hh.ru/employer/5325","logo_urls":{"240":"https://hhcdn.ru/employer-logo/6048634.png","90":"https://hhcdn.ru/employer-logo/6048633.png","original":"https://hhcdn.ru/employer-logo-original/1107007.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=5325&host=hh.ru","accredited_it_employer":false,"trusted":true},"published_at":"2023-08-11T18:00:51+0300","created_at":"2023-08-11T18:00:51+0300","initial_created_at":"2023-08-11T17:25:29+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=84960387","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/84960387","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false,"languages":[]}