{"id":"85103097","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Главный инженер разработки (DevOps /SRE)","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":{"id":"3388-3388-gazprom","name":"Газпромбанк"},"contacts":null,"description":"<p><strong>Кто мы:</strong><br />Мы - банк, который входит в тройку крупнейших банков России, и золотой работодатель по версии Forbes. Сейчас мы проходим этап технологической трансформации.</p> <p>От Вас потребуется умение масштабно мыслить, искать оптимальные пути решения задач, планировать свою работу, умение брать на себя ответственность за решение поставленных задач, участвовать в разработке и реализации сложных технических решений.<br />Мы ищем увлеченных специалистов, способных реализовывать задачи, которыми можно гордиться</p> <p><strong>Чем тебе предстоит заниматься:</strong><br />Обеспечение непрерывной работы приложений и сервисов под высокой нагрузкой<br />Управление обновлениями, настройками, мониторинг, восстановление после сбоев, планирование изменений, предупреждение и решение инцидентов.<br />Выполнение задач по автоматизация рутинных задач и предоставление инструментов для продуктовых команд, автоматизация задач администрирования промышленных стендов приложений и баз данных.<br />Автоматизация инфраструктуры и вывод сервисов посредством Jenkins/Ansible/Python/Bash.<br />Развитие процессов CI/CD, применение методологии и инструментов DevOps в работе (BitBucket, Ansible, Jenkins);<br />Настройка, развитие систем мониторинга (Prometheus, Grafana) и анализа логов и событий (ELK/EFK).<br />Активное взаимодействие с командами разработчиков и тестировщиков.</p> <p><strong>Как понять, что мы подходим друг другу:</strong><br />Опыт аналогичной работы от 2-х лет.<br />Уверенное владение Linux на уровне системного администратора<br />Понимание принципов работы сетей и протоколов взаимодействия приложений, навыки диагностики проблем с ними<br />Понимание основ и принципов масштабирования и обеспечения надежности, высокой доступности и производительности сервисов и инфраструктуры<br />Практический опыт автоматизации работы с использованием скриптовых языков<br />Практический опыт использования и администрирования систем мониторинга и агрегаторов журналов событий приложений Prometheus/FluentD/Grafana/Kibana<br />Опыт администрирования: Linux; Cистем управления конфигурациями ansible; БД PostgreSQL; Rabbit MQ; Kafka; Elasticsearch; Redis(опц); Cassandra(опц).</p> <p><strong>Почему мы? У нас круто!</strong><br />- Созидательная среда и интересные проекты<br />- Работа в команде профессионалов. Неравнодушных, активных, ответственных за свой результат.<br />- Конкурентная заработная плата и система премирования.<br />- Привлекательный социальный пакет:<br />медицинская страховка с первого дня работы<br />отпуск 33 календарных дня<br />материальная помощь и дополнительные выплаты<br />дисконтные и корпоративные программы компаний-партнеров</p> <p>- Обширные возможности для всестороннего развития и расширения кругозора сотрудников:<br />программы по развитию профессиональных знаний, личных качеств, управленческих компетенций<br />ГПБИнтеллекторий, КВИЗы, Спартакиада, программы Трансформации Духа, разума и силы лайфхаки от гуру в различных областях<br />знакомство и обмен опытом с коллегами из других подразделений и других городов<br />танцы, занятия по вокалу, актерскому мастерству – это только малая часть айсберга корпоративно-культурной жизни, предлагаемой сотрудникам.<br />- Комфортные условия работы<br />- Современные и удобные офисы в пешей доступности от метро.</p>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[],"professional_roles":[{"id":"160","name":"DevOps-инженер"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"3388","name":"Газпромбанк","url":"https://api.hh.ru/employers/3388?host=hh.ru","alternate_url":"https://hh.ru/employer/3388","logo_urls":{"original":"https://hhcdn.ru/employer-logo-original/803938.png","90":"https://hhcdn.ru/employer-logo/3656639.png","240":"https://hhcdn.ru/employer-logo/3656640.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=3388&host=hh.ru","accredited_it_employer":false,"trusted":true},"published_at":"2023-08-29T10:39:03+0300","created_at":"2023-08-29T10:39:03+0300","initial_created_at":"2023-08-15T11:02:32+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=85103097","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/85103097","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false,"languages":[]}