{"id":"85324185","premium":false,"billing_type":{"id":"standard_plus","name":"Стандарт плюс"},"relations":[],"name":"DevOps Engineer (Kubernetes)","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":{"from":null,"to":350000,"currency":"RUR","gross":false},"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"remote","name":"Удаленная работа"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p>Команда <strong>Evrone</strong> занимается продуктовой разработкой стартапов и помогает в цифровой трансформации бизнеса в России, США и Европе.</p> <p>Мы занимаемся технически сложными, высоконагруженными, наукоёмкими проектами, проектами с большой бизнес логикой или большой серверной инфраструктурой. Нам доверяют: аналитику, проектирование интерфейсов и дизайн, разработку, инфраструктуру и эксплуатацию. Мы становимся технической командой проекта целиком или консультируем и расширяем возможности существующих команд наших клиентов.</p> <p>Кроме того, Evrone помогает развиваться сообществу разработчиков. Мы делаем самую большую в России конференцию по Ruby — RubyRussia, проводим технические митапы, делаем свой новостной дайджест, а также спонсируем и помогаем в проведении конференций по Go, Python, React/Vue и функциональным языкам.</p> <p>Наши инженеры выступают на ведущих конференциях России и Европы и вносят вклад в Open Source проекты, мы берем интервью у лидеров комьюнити и пишем статьи на самые горячие темы индустрии. В этом году мы ставили стенд и выступали на конференциях <strong>Highload</strong> и <strong>TeamLeadConf</strong>.</p> <p>Вся команда работает удаленно с 2008 года. Мы знаем как организовать распределенную разработку комфортно и эффективно. Есть офисы для работы и встреч в Москве и Воронеже, а также офисы продаж в Сан-Франциско и Берлине.</p> <p><strong>Cтек, который мы используем в работе:</strong> AWS / Yandex.Cloud, Kubernetes, Docker, Terraform, Ansible, Prometheus, Grafana, PostgreSQL, Redis</p> <p><strong>Задачи:</strong> Влиться в одну из существующих команд разработки и участвовать в разнообразных проектах компании. Про наши последние проекты можно почитать тут: <strong>evrone.ru/cases</strong></p> <p>Сейчас мы ищем инженеров уровня Middle / Middle+ / Senior / Architect-уровня. Заработная плата зависит от уровня и определяется после прохождения технического собеседования.</p> <p><strong>Мы хотим видеть в вас:</strong></p> <ul> <li>Навыки поднятия окружения в облачных провайдерах (AWS, GCE, DigitalOcean), а также деплоймент системы оркестровки на BareMetal машины;</li> <li>Опыт оркестрации боевых проектов с помощью <strong>Kubernetes</strong> (K8s и K3s);</li> <li>Terraform, Ansible;</li> <li>Опыт работы с разными CI/CD. Мы используем Github Actions, GitlabCI, CircleCI и TeamCity;</li> <li>Знание, опыт работы с PostgreSQL, RabbitMQ, Redis (вплоть до кластеризации сервисов);</li> <li>Настройка репликации баз данных, облачных хранилищ;</li> <li>Опыт работ с хотя бы одним мониторинговым инструментом (Prometheus, Grafana);</li> <li>Умение автоматизировать рутинные операции на одном из скриптовых языков (Bash, Python, Ruby);</li> <li>Опыт настройки централизованного инструмента управления логами (EFK/ELK, Loki);</li> <li>Системы контроля версий (Git).</li> </ul> <p><strong>Что предлагаем:</strong></p> <ul> <li>Удаленную фултайм работу. Нам не важно, из какой точки мира вы работаете, важен только результат. Но если вы хотите ходить в офис, они есть Москве и Воронеже;</li> <li>Мягкий график. Достаточно синхронизировать тайм-зоны и иметь пересечения рабочего времени с командой;</li> <li>Качественный онбординг и hr-менеджмент (1:1, Grow Review). По желанию меняем проекты, не даем стагнировать. При формировании команды проекта учитываем профессиональные или личные интересы разработчиков;</li> <li>Работу в разновозрастном, разнополом и потрясающе дружном и профессиональном коллективе;</li> <li>Хорошо организованный воркфлоу, отсутствие бюрократии. Работа на доверии.</li> </ul> <p><strong>Одна из ценностей Evrone – работа с удовольствием.</strong><br />Для этого мы придумали<strong> Evrone Benefits. </strong>Каждому из нас выделяется годовой бюджет, автоматически пополняемый каждый новый год вашей работы в Evrone. Его можно потратить на полезные категории трат, направленные на:</p> <ul> <li>ДМС и здоровье;</li> <li>Спорт и абонемент для фитнеса или инвентарь для спорта;</li> <li>Курсы иностранного языка;</li> <li>Техника для работы и улучшение рабочего места;</li> <li>Обучение: курсы, тренинги, мастер-классы, семинары, книги и конференции.</li> </ul> <p><strong>Бонусы и премии:</strong></p> <ul> <li>Премии за локальные успехи и отличную работу в целом;</li> <li>Автоматическая индексация зарплаты без необходимости кого-то об этом просить, а также повышение зарплаты по мере роста компетенций;</li> <li>Премии за привлечение новых сотрудников и новых клиентов;</li> <li>Дополнительная премия за выступления на конференциях и митапах;</li> <li>У вас есть возможность принять участие в проведении технических интервью специалистов, которые могут стать вашими коллегами. Проведение интервью оплачивается.</li> </ul> <p><strong>Обучение и рост компетенций:</strong></p> <ul> <li>Проводим внутренние митапы по DevOps;</li> <li>У нас есть культура менторства. В повседневных задачах и планировании карьеры будет помогать наставник;</li> <li>Развивать профессиональный уровень можно с помощью системы ассессмента Evrone Challenge;</li> <li>Есть внутренняя библиотека с электронными книгами и записанными курсами;</li> <li>Работаем и дружим с западными заказчиками, есть возможность практиковать свой английский.</li> </ul> <p><strong>Возможность стать докладчиком или автором:</strong></p> <ul> <li>Если вы хотите выступить на оффлайн конференции, мы поможем вам подготовить контент для доклада и сделаем крутые слайды. DevRel Evrone (Григорий Петров) поможет подготовиться к выступлению на конференции, окажем поддержку на самой конференции и подготовим материалы с вашим докладом. Также Evrone оплатит вам все расходы на подготовку, поездку и участие в конференции;</li> <li>Если вы хотите выступить на онлайн конференции, помимо помощи по подготовке доклада и подбору конференции, мы организуем вам студийную съемку или трансляцию вашего доклада;</li> <li>У нас есть блоги на всех популярных платформах России и мира. Наши редакторы и профессиональные авторы еженедельно выпускают новые материалы;</li> <li>Если вы написали статью, мы нарисуем для нее иллюстрации и поможем вам ее оформить и опубликовать. Если у вас есть только идея - редакторы помогут сформулировать мысли, оформить пост самостоятельно и правильно опубликовать для максимального охвата. Конечно, Evrone оплатит часы и любые затраты, потраченные на подготовку материала;</li> </ul> <p><strong>Возможность прокачаться в Open Source:</strong></p> <ul> <li>Если у вас есть популярные open source проекты – мы поможем с их продвижением и окажем поддержку в развитии;</li> <li>Если вы контрибьютите в популярные проекты с открытым исходным кодом, мы оплатим часы, которые вы на это потратили.</li> <li>Если вы ничего этого не делаете, но очень хочется начать – в Evrone есть менторы, которые помогут вам сделать первые шаги: подберут задачки для старта, помогут решить их и правильно оформить pr.</li> </ul> <p><strong>Отдых и развиртуализация:</strong></p> <p>Мы считаем обязательным собираться вместе несколько раз в году. В Evrone есть несколько событий в году, которые собирают вместе весь наш коллектив. Поэтому, где бы вы ни находились, мы обязательно увидимся лично (компания оплатит вам дорогу и все расходы на корпоратив).</p>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Docker"},{"name":"Kubernetes"},{"name":"Git"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[],"professional_roles":[{"id":"160","name":"DevOps-инженер"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"598471","name":"evrone.ru","url":"https://api.hh.ru/employers/598471?host=hh.ru","alternate_url":"https://hh.ru/employer/598471","logo_urls":{"original":"https://hhcdn.ru/employer-logo-original/479584.png","240":"https://hhcdn.ru/employer-logo/2360189.png","90":"https://hhcdn.ru/employer-logo/2360188.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=598471&host=hh.ru","accredited_it_employer":false,"trusted":true},"published_at":"2023-09-02T22:46:41+0300","created_at":"2023-09-02T22:46:41+0300","initial_created_at":"2023-08-18T22:46:41+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=85324185","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/85324185","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false,"languages":[]}