{"id":"85890317","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Team Lead DevOps","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":{"from":350000,"to":450000,"currency":"RUR","gross":false},"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"experience":{"id":"moreThan6","name":"Более 6 лет"},"schedule":{"id":"remote","name":"Удаленная работа"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p>Приглашаем в команду Компэл руководителя команды DevOps. Компэл - обеспечивает электронными компонентами и модулями производителей электронной аппаратуры в России. Мы создаем коммерческую цифровую В2В экосистему, которая будет доступна каждому предприятию разрабатывающему и производящему электронные изделия, создаем решения для клиентских рабочих мест, бэк-офиса, интегрируемся с различными системами, работаем с большими данными. Наша цель – обеспечить Time to market за счет своевременной поставки качественного ПО. Используемый стек: Python (FastAPI), React, Java (Spring), PostgreSQL, Kafka, Keycloak, MongoDB, RabbitMQ, Prometheus, Alertmanager, Grafana, Elasticsearch, Kibana, OpenAPI, C4 (structurizr DSL), MSA, Microfrontends, Kubernetes, Multi-cloud, GitLab, Jira, Confluence.</p> <p><strong>Обязанности:</strong></p> <ol> <li>​​​​​​​Руководство командой инженеров.</li> <li>Руководство проектом по переходу на облачную инфраструктуру.</li> <li>Поддержка и оптимизация существующих систем, развернутых в Kubernetes кластере в клауде.</li> <li>Разработка, настройка и поддержка инфраструктуры для автоматического развертывания, масштабирования и управления приложениями в Kubernetes кластере.</li> <li>Разработка и поддержка CI/CD пайплайнов для автоматического развертывания приложений в Kubernetes кластере.</li> <li>Анализ и улучшение производительности и надежности Kubernetes кластера.</li> <li>Мониторинг развернутых систем.</li> </ol> <strong>Требования:</strong> <ol> <li>​​​​​​​​​​​​​​Образование: Высшее образование, это не наличие диплома, а наличие реального образования любое.</li> <li>Знание ин. языков: англ., чтение документации.</li> <li>Опыт работы с Kubernetes и его экосистемой (Helm, kubectl, kubeadm и т.д.).</li> <li>Опыт работы с системами мониторинга (Prometheus, Grafana, Alertmanager) и логирования (ELK Stack).</li> <li>Опыт работы с GitLab и CI/CD пайплайнами.</li> <li>Опыт работы с облачными сервисами, предпочтительно Aliyun, Azure.</li> <li>Знание принципов мониторинга и анализа производительности сети и приложений.</li> <li>Опыт автоматизации процессов и настройки инфраструктуры с помощью инструментов, таких как Ansible, Terraform и т.д.</li> <li>Личные качества: Самостоятельность в решении задач. Желание осваивать что-то новое.</li> </ol> <strong>Условия:</strong> <ol> <li>​​​​​​​​​​​​​​Стартовая ЗП: 350000 - 450000 на руки. Бонусы за завершенные проекты.</li> <li>Мы предлагаем корпоративную well-being программу:</li> </ol> <ul> <li>ДМС - Комплексная система медицинского страхования сотрудников, в том числе возможность прикрепления членов семьи по корпоративным тарифам, страхование выезжающих за границу.</li> <li>График работы - компания предлагает удалённый или гибридный график работы для поддержания баланса между трудовой деятельностью и личной жизнью сотрудников.</li> <li>Возможность развития и роста внутри компании - тренинги от ведущих мировых компаний, в т.ч. производителей электронных компонентов. Возможность пройти профессиональное обучение по запросу.</li> <li>Спортивная онлайн платформа, направленная на поддержание здорового образа жизни и благополучия сотрудников (видео-тренировки с тренером, йога, фитнес и многое другое).</li> <li>Онлайн мероприятия для поддержания позитивного настроения сотрудников и возможности проведения совместного досуга (квизы, квесты, кулинарные мастер классы, рандом кофе, корпоративные вечеринки).</li> <li>Корпоративная культура «Компэл» отличается открытостью, доброжелательностью и духом сотрудничества.</li> <li>Мы будем рады видеть Вас частью нашей команды.</li> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[],"professional_roles":[{"id":"160","name":"DevOps-инженер"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"247","name":"Компэл","url":"https://api.hh.ru/employers/247?host=hh.ru","alternate_url":"https://hh.ru/employer/247","logo_urls":{"90":"https://hhcdn.ru/employer-logo/308327.png","240":"https://hhcdn.ru/employer-logo/381184.png","original":"https://hhcdn.ru/employer-logo-original/233601.gif"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=247&host=hh.ru","accredited_it_employer":false,"trusted":true},"published_at":"2023-08-28T16:01:41+0300","created_at":"2023-08-28T16:01:41+0300","initial_created_at":"2023-08-28T16:01:41+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=85890317","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/85890317","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false,"languages":[]}