{"id":"85908865","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Python Backend Engineer with DevOps skills","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":{"from":3500,"to":4500,"currency":"RUR","gross":false},"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>About the Role</strong></p> <p>As a Backend Engineer at Zentist your work drives the business. Every commit you make to automate outdated manual workflows saves more people from enduring thousands of hours of frustration in dental offices across the country. You and your team pioneer solutions to make the system reliable, scalable, and easy to reason about.</p> <p><strong>Your team</strong></p> <ul> <li>Develops the automated data flows which power our entire business, saving dental offices significant time and money</li> <li>Creates new interfaces to an increasing number of dental back office systems, increasing Zentist&#39;s impact in the market</li> <li>Evaluates capabilities and limitations of our existing architecture and creates the next generation of systems to effortlessly scale to thousands of practices</li> <li>Raises the bar in our pursuit of small, fast, quality releases which incrementally create a great experience for both internal and external customers</li> </ul> <p><strong>You come to us with</strong></p> <ul> <li>Several years of development experience. You directly influence the technical design of critical systems and shepherd them through the entire development process.</li> <li>Experience contributing to web applications written in Python and frequently collaborating with front end developers.</li> <li>A drive to continually increase your team&#39;s code quality by promoting best practices and techniques based on your real-life experience.</li> <li>Integration experience that makes the best use of available APIs and support while identifying and building around their limitations.</li> <li>History of continuous learning and improvement, keeping your skills current and leading to an understanding of new technical options.</li> </ul> <p>Our teams currently use Python 3.x, Flask, Graphene, Alchemy, SQL, Docker, K8s, Cypress, PyTest, React and various 3rd party APIs.</p> <p><strong>About Zentist</strong></p> <p>Dental insurance plans are notoriously complicated. Policy agreements are difficult for consumers to understand and for providers to service and manage. We started Zentist because we believe neither consumers nor providers should struggle with the complexity of understanding and utilizing dental plans. At Zentist, we are developing billing technology between dental providers and insurance companies that abstracts away all the complexity of billing and collecting insurance.</p> <p>We’re located in San Francisco and we’re backed by leading investment firms including Costanoa Ventures, Point Nine Capital, and Fika Ventures. We would like to build our core team at a foundational point in the company to help us build a category-defining product for the long-term.</p> <p>At Zentist, we promote a productive and collaborative culture. We work hard, have fun, and treat people with respect. Our benefits include a competitive salary and equity package, a culture of learning and development, and more!</p> <p>Zentist is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.</p> <ul> <li> </li> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Python"},{"name":"Английский язык"},{"name":"Docker"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[],"professional_roles":[{"id":"40","name":"Другое"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"9833938","name":"Zentist","url":"https://api.hh.ru/employers/9833938?host=hh.ru","alternate_url":"https://hh.ru/employer/9833938","logo_urls":null,"vacancies_url":"https://api.hh.ru/vacancies?employer_id=9833938&host=hh.ru","accredited_it_employer":false,"trusted":true},"published_at":"2023-08-29T01:14:47+0300","created_at":"2023-08-29T01:14:47+0300","initial_created_at":"2023-08-29T01:14:47+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=85908865","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/85908865","working_days":[],"working_time_intervals":[],"working_time_modes":[{"id":"start_after_sixteen","name":"Можно начинать работать после 16:00"}],"accept_temporary":false,"languages":[]}