{"id":"86002674","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Системный администратор (devops)","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":{"city":"Подгорица","street":null,"building":null,"lat":42.441228,"lng":19.263141,"description":null,"raw":"Подгорица","metro":null,"metro_stations":[]},"allow_messages":true,"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"remote","name":"Удаленная работа"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p> </p> <p>Привет! Меня зовут Андрей – руководитель ИТ отдела компании TGR.</p> <p>Сейчас ми ищем системного администратора и devops по совместительству.</p> <p>По собственному опыту знаю, что из стандартного описания на джоб-сайте трудно понять, твоя компания или нет. Поэтому в этой вакансии я постарался честно и подробно рассказать о позиции которую мы ищем, нашей команде и компании.</p> <p><strong>Теперь о наших требованиях к специалисту, которого мы ищем:</strong></p> <p>Теперь о наших требованиях к специалисту, которого мы ищем:<br /><br />Имеет глубокие знания как Windows (Active Directory , IPv4, OSPF, VRRP, NAT, DHCP, SNMP, VLAN,) так и Linux серверах.<br />Знание и опыт работы Nginx.<br />Знает сетевую модель OSI и строил сложные сети на оборудовании Mikrotik.<br />Имеет опыт администрирования систем виртуализации<br />Имеет опыт построения отказоустойчивых, высоко нагруженных систем<br />Имеет опыт администрирования СУБД (MS SQL, PostgreSQL, MongoDB)<br />Опыт использования облачных систем (AWS, hetzner, vultr), понимание что такое SaaS<br />Поддержка телефонии (Zadarma)<br />Знание и опыт работы почтовых протоколов (imap, pop3, smtp, dkim, dmark, spf…) и почтовых серверов (ZIBMRA).<br />Администрирование систем мониторинга (Prometheus)<br />Имеет желание &quot;докопаться&quot; до причин возникновения каких-либо проблем, а не просто разобраться с их последствиями.<br />Понимает важность создания бэкапов, необходимость их дублирования, проведения периодических проверок путем &quot;развертывания&quot; бэкапов и на практике использует это в своей работе.<br />Работает на результат, а не &quot;с девяти до шести, чтобы отсидеть&quot;<br />Требователен к себе и к окружающим.<br />&quot;Интересуется&quot; сферой ИТ в свободное от работы время.<br /><br />Твои функциональные обязанности:<br /><br />Поддержка пользователей<br />Поддержка серверной инфраструктуры Windows Server, *NIX.<br />Поддержка почтовых серверов (Zimbra, Roundcube), Google Workspace.<br />Участие в проектах по внедрению нового ПО<br />Развертывание ПО и установка обновлений<br />Поддержка процесса тестирования<br />Участие в разработке ИТ архитектуры систем;<br />Сопровождение серверной инфраструктуры на VDS.<br />Поддержка и участие в разработке сетевой инфраструктуры;<br />Настройка и инсталляция операционных систем и бизнес приложений;<br />Мониторинг работоспособности инфраструктурных компонентов систем;<br />Взаимодействие c разработчиками и подрядчиками при тестировании и отладке бизнес приложений;<br />Оформление технической документации</p> <p> </p> <p><strong>Что у нас есть:</strong></p> <ol> <li>Адекватный руководитель. Я всегда в доступе, чтобы ты мог подойти и задать вопрос. Кроме того, каждую неделю у нас будут индивидуальные встречи.</li> <li>Работаем по best practice. Например: 1. Бэкапы делаются постоянно, складываются в несколько разных мест, если необходимо - шифруются и время от времени проверяются. 2. Элементы инфраструктуры дублируют критические функции (интернет, оборудование...).</li> <li>Есть бюджет на ИТ (пользуемся Google Workspace, все критические сервисы находятся в облаке...).</li> <li>Поэтапная адаптация на должности: план обучения профессиональным задачам, адаптация к внутренним правилам компании, постоянные встречи со мной.</li> <li>У нас отсутствует бюрократия, решения принимаются быстро. Право голоса есть у всех - любая твоя идея будет услышана, и если она релевантна, мы ее реализуем.</li> <li>Финансовая стабильность - официальное трудоустройство с первого дня, зарплата дважды в месяц без задержек, 20 дней оплачиваемого отпуска.</li> <li>Пересмотр зарплаты каждый год.</li> <li>Внешнее профессиональное обучение и курсы</li> <li>И конечно, здравый смысл и чувство юмора. Никакого официоза - все здесь на &quot;ты&quot;.</li> </ol> <p> </p> <p><strong>Все компании разные, поэтому я хочу рассказать тебе о наших основных принципах работы:</strong></p> <p>Планирование. Каждый сотрудник может гибко работать с собственной нагрузкой и самостоятельно планировать задачи на неделю. Часть времени занимают &quot;обязательные&quot; задачи: подготовка отчетов, встреч и т.д. Продолжительность таких задач должна быть зафиксирована в часах. Остальное время отводится под проектные задачи, по ним также должна быть оценена и зафиксирована продолжительность. Например, если нам нужно запустить новый сервис, который будет размещен на отдельном виртуальном сервере, то эта задача состоит из более мелких задач:</p> <p> </p> <p>1. Сформулировать требования к работе нового сервиса (здесь все сильно зависит от функционала сервиса, но мы говорим о часах, а не днях)</p> <p>2. Принять решение по размещению и ресурсам для сервера ХХХ в соответствии с целями его использования</p> <p>3. Настроить работу сервиса YYY на сервере ХХХ (здесь все сильно зависит от функционала сервиса, но мы говорим о часах, а не днях)</p> <p>4. Залогировать все доступы к серверу ХХХ и специфические настройки (0.25 часа)</p> <p>5. Добавить сервер ХХХ в систему мониторинга Zabbix (0.15 часа)</p> <p>6. Настроить бэкап сервера ХХХ отдельной задачей в Veeam согласно существующего расписания задач // это если сервер будет находиться на наших физических серверах (0.25 часа)</p> <p>7. Настроить реплику сервера ХХХ отдельной задачей в Veeam согласно существующего расписания задач // это если сервер будет находиться на наших физических серверах (0.25 часа)</p> <p>8. Создать документацию по работе сервиса YYY на сервере ХХХ (в среднем 0.5 - 2 часа, в зависимости от того, что именно было настроено)</p> <p>9. Проанализировать через неделю полноценной работы ресурсы, выделенные под сервер ХХХ и при необходимости внести корректировки (0.25 часа)</p> <p> </p> <p>Мы верим, что человек может продуктивно работать головой более 3 часов. Реально все твое рабочее время будет занято задачами. Все в компании понимаем: если задача горит, домой вовремя не уходим, а доделываем. Да, иногда возможны задержки на работе, но много работы = много опыта.</p> <p><strong>Как формируется заработная плата?</strong></p> <p>Зарплата у всех в компании состоит из ставки и из бонусной части. У тебя будут квартальный и годовой бонус.</p> <p><strong>Этапы найма:</strong></p> <ol> <li>Откликаешься на вакансию, в сопроводительном письме указываешь ожидания по зарплате;</li> <li>Если твое резюме соответствует нашим требованиям, общаемся по телефону;</li> <li>Если находим общий язык, зову на Zoom и знакомиться лично;</li> <li>Если на встрече у нас произошел match, даем тебе тестовое задание ;</li> <li>Если уровень выполнения тестового соответствует нашим потребностям на этой позиции, назначаю на ближайшее время финальное собеседование с СЕО компании;</li> <li>Мы примем решение во время финального собеседования или на следующий день и будем ожидать такой же скорости ответа с твоей стороны</li> </ol> <p> </p> <p><strong>Как будет проходить твоя адаптация?</strong></p> <p>Наша задача - как можно быстрее тебя запустить в рабочие задачи. Ты будешь работать с реальными задачами уже с первых дней. У нас есть обучение по профессиональным обязанностям (самостоятельное изучение инструкций и правил) и непрофессиональная адаптация (принципы и правила работы компании), чтобы стать своим и быстро выйти на нужные результаты.</p> <p> </p> <p>В первый день получишь план введения в позицию и базу знаний. Вся информация разделена на блоки, которые нужно прочитать, понять, при необходимости задать вопросы по ним. Во время проверки знаний ты должен ответить на все мои вопросы по этой информации. Каждый день у тебя будут встречи со мной для постепенной (блок за блоком) экзаменации и вопросов/уточнений. У меня выделено время на твою адаптацию, никто тебя не оставит один на один с незнакомыми задачами</p> <p> </p>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[],"professional_roles":[{"id":"113","name":"Системный администратор"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"9113971","name":"TGR Partners","url":"https://api.hh.ru/employers/9113971?host=hh.ru","alternate_url":"https://hh.ru/employer/9113971","logo_urls":{"original":"https://hhcdn.ru/employer-logo-original/1034558.jpg","240":"https://hhcdn.ru/employer-logo/5758993.jpeg","90":"https://hhcdn.ru/employer-logo/5758992.jpeg"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=9113971&host=hh.ru","accredited_it_employer":false,"trusted":true},"published_at":"2023-08-30T13:31:19+0300","created_at":"2023-08-30T13:31:19+0300","initial_created_at":"2023-08-30T13:31:19+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=86002674","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/86002674","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false,"languages":[{"id":"eng","name":"Английский","level":{"id":"b2","name":"B2 — Средне-продвинутый"}}]}