{"id":"86118505","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Nix DevOps Engineer","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":{"from":null,"to":500000,"currency":"RUR","gross":false},"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"experience":{"id":"moreThan6","name":"Более 6 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>Ищем DevOps Engineer для выстраивания инфраструктуры с физическими и облачными серверами с использованием Nix/NixOS</strong></p> <p>Мы занимаемся <strong>высокочастотным трейдингом</strong> (HFT) – решаем сложные технологические задачи, соревнуясь с сильнейшими командами по всему миру на уровне микро-, а зачастую и наносекунд. Чтобы делать это успешно, мы используем кастомные инфраструктурные сетапы, соединяющие в себе FPGA, облачные и физические сервера по всему миру и разные биржи со специфичными сетевыми настройками.</p> <p>Настроить такой разношерстный сетап, чтобы он просто стабильно работал – уже непростая задача. Настроить и автоматизировать его так, чтобы он быстро реагировал на запросы бизнеса – настоящий вызов для большинства даже опытных DevOps-специалистов. Мы считаем, что нашей “серебряной пулей” здесь может стать Nix/NixOS, и ищем опытного DevOps-инженера, который уже может или хочет научиться его использовать.</p> <p>В составе команды этот человек будет работать над критически важными для бизнеса вещами: выстраивать с нуля инфраструктуру с физическими и облачными серверами, принимать архитектурные решения, качественно улучшать деплой. Спектр задач – фактически неограниченный: от обеспечения сборки оптимального С++-кода и автоматизации сетапа под сервера разного типа до работы с сетями и стендами с кастомным железом.</p> <p><strong>Мы предоставим: </strong></p> <ul> <li> <p>Все необходимое для профессионального развития: доступ к самым передовым технологиям, задачи широкого спектра, большую зону ответственности и быструю обратную связь;</p> </li> <li> <p>Команду, которая поддержит в достижении поставленных целей: специалисты из tier-1 компаний с 10+ годами опыта в индустрии, плоская структура, выстроенные ремоут-процессы;</p> </li> <li> <p>Уровень дохода в соответствии с персональным вкладом в PnL компании;</p> </li> <li> <p>Заботу о сотрудниках уровня олимпийской сборной: корпоративные нутрициолог и wellbeing-коуч, трекинг и помощь с поддержанием ключевых показателей здоровья, полное ДМС, организация досуга и еда в офисе из лучших<strong> </strong>ресторанов<strong>.</strong></p> </li> </ul> <p><strong>Мы ждем, что вы: </strong></p> <ul> <li> <p>Имеете опыт работы с Nix/NixOS или хотите изучить их для создания кастомных решений в сфере HFT;</p> </li> <li> <p>Будете тесно тесно сотрудничать с командой разработки, предоставляя им необходимые инструменты и ресурсы для эффективной работы, тестирования и развертывания внутренних продуктов;</p> </li> <li> <p>Будете создавать и поддерживать автоматизированные процессы сборки, тестирования и развертывания приложений с целью ускорения разработки и обеспечения высокого качества продукта;</p> </li> <li> <p>Будете обеспечивать надежность и доступность инфраструктуры компании, используя системы мониторинга;</p> </li> <li> <p>Будете не только поддерживать высокий уровень стабильности текущей инфраструктуры, но и качественно улучшать ее, проводя эксперименты и внедряя новые решения;</p> </li> <li> <p>Сможете ускорить разработку и обеспечить высокое качество продукта через создание автоматизированных процессов сборки, тестирования и развертывания приложений.</p> </li> </ul> <p><strong>Нам интересно поговорить с кандидатами, которые имеют:</strong></p> <ul> <li> <p>Опыт сборки и создания пакетов (RPM, DEB и.т.д.) для проектов на С++;</p> </li> <li> <p>Понимание особенностей сборки проектов под разные дистрибутивы, динамической и статической линковки;</p> </li> <li> <p>Понимание принципов IaC. Опыт с Terraform, Packer и подобными системами;</p> </li> <li> <p>Опыт построения CI/CD конвейеров (GitLab CI / Jenkins), в том числе стендов для end-to-end тестирования;</p> </li> <li> <p>Опыт администрирования Linux/FreeBSD серверов, поддержания бесперебойной работы сервисов и мониторинга;</p> </li> <li> <p>Опыт удалённой настройки физических серверов (HP, Supermicro) приветствуется;</p> </li> <li> <p>Понимание принципов работы IP-сетей. Опыт с организацией VPN, схем NAT, сетей для виртуальных машин;</p> </li> <li> <p>Опыт с организацией хранения данных. Опыт с распределёнными ФС приветствуется;</p> </li> <li> <p>Опыт MLOps (построение кластеров для обучения моделей и вычислительных экспериментов) приветствуется.</p> </li> <li> <p>Опыт работы с системами мониторинга и алертинга</p> </li> </ul> <ul> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Nix"},{"name":"Linux"},{"name":"Terraform"},{"name":"Ansible"},{"name":"NixOS"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[],"professional_roles":[{"id":"160","name":"DevOps-инженер"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"9882284","name":"Спектральные Технологии","url":"https://api.hh.ru/employers/9882284?host=hh.ru","alternate_url":"https://hh.ru/employer/9882284","logo_urls":{"240":"https://hhcdn.ru/employer-logo/6067854.png","90":"https://hhcdn.ru/employer-logo/6067853.png","original":"https://hhcdn.ru/employer-logo-original/1111813.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=9882284&host=hh.ru","accredited_it_employer":false,"trusted":true},"published_at":"2023-09-01T15:43:31+0300","created_at":"2023-09-01T15:43:31+0300","initial_created_at":"2023-09-01T15:43:31+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=86118505","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/86118505","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false,"languages":[]}